balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/16xxxx/PIC16F1936.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP5CON" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP5CON" edc:nzwidth="0x8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP5M0" edc:desc="" edc:mask="0x1" edc:name="CCP5M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5M1" edc:desc="" edc:mask="0x1" edc:name="CCP5M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5M2" edc:desc="" edc:mask="0x1" edc:name="CCP5M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5M3" edc:desc="" edc:mask="0x1" edc:name="CCP5M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC5B0" edc:desc="" edc:mask="0x1" edc:name="DC5B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC5B1" edc:desc="" edc:mask="0x1" edc:name="DC5B1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="7" edc:beginaddr="0x380" edc:endaddr="0x3A0" edc:regionid="sfr7">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBP" edc:desc="Interrupt-On-Change Positive Edge Register" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBP" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBP0" edc:desc="" edc:mask="0x1" edc:name="IOCBP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP1" edc:desc="" edc:mask="0x1" edc:name="IOCBP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP2" edc:desc="" edc:mask="0x1" edc:name="IOCBP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP3" edc:desc="" edc:mask="0x1" edc:name="IOCBP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP4" edc:desc="" edc:mask="0x1" edc:name="IOCBP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP5" edc:desc="" edc:mask="0x1" edc:name="IOCBP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP6" edc:desc="" edc:mask="0x1" edc:name="IOCBP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP7" edc:desc="" edc:mask="0x1" edc:name="IOCBP7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCBP" edc:desc="" edc:mask="0xff" edc:name="IOCBP" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBN" edc:desc="Interrupt-On-Change Negative Edge Register" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBN" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBN0" edc:desc="" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN1" edc:desc="" edc:mask="0x1" edc:name="IOCBN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN2" edc:desc="" edc:mask="0x1" edc:name="IOCBN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN3" edc:desc="" edc:mask="0x1" edc:name="IOCBN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN4" edc:desc="" edc:mask="0x1" edc:name="IOCBN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN5" edc:desc="" edc:mask="0x1" edc:name="IOCBN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN6" edc:desc="" edc:mask="0x1" edc:name="IOCBN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN7" edc:desc="" edc:mask="0x1" edc:name="IOCBN7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCBN" edc:desc="" edc:mask="0xff" edc:name="IOCBN" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBF" edc:desc="Interrupt-On-Change Flag Register" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBF" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBF0" edc:desc="" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF1" edc:desc="" edc:mask="0x1" edc:name="IOCBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF2" edc:desc="" edc:mask="0x1" edc:name="IOCBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF3" edc:desc="" edc:mask="0x1" edc:name="IOCBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF4" edc:desc="" edc:mask="0x1" edc:name="IOCBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF5" edc:desc="" edc:mask="0x1" edc:name="IOCBF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF6" edc:desc="" edc:mask="0x1" edc:name="IOCBF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF7" edc:desc="" edc:mask="0x1" edc:name="IOCBF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCBF" edc:desc="" edc:mask="0xff" edc:name="IOCBF" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="8" edc:beginaddr="0x400" edc:endaddr="0x420" edc:regionid="sfr8">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="9"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR4" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4" edc:desc="" edc:mask="0xff" edc:name="TMR4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PR4" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR4" edc:desc="" edc:mask="0xff" edc:name="PR4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T4CON" edc:desc="Timer2 Control Register" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T4CON" edc:nzwidth="0x8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T4CKPS0" edc:desc="Timer2 Clock Prescale Select bits" edc:mask="0x1" edc:name="T4CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPS1" edc:desc="Timer2 Clock Prescale Select bits" edc:mask="0x1" edc:name="T4CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4ON" edc:desc="Timer2 On bit" edc:mask="0x1" edc:name="TMR4ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS0" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T4OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS1" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T4OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS2" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T4OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS3" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T4OUTPS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T4CKPS" edc:desc="Timer2 Clock Prescale Select bits" edc:mask="0x3" edc:name="T4CKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T4OUTPS" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0xf" edc:name="T4OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR6" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR6" edc:desc="" edc:mask="0xff" edc:name="TMR6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PR6" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR6" edc:desc="" edc:mask="0xff" edc:name="PR6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T6CON" edc:desc="Timer2 Control Register" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="T6CON" edc:nzwidth="0x8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T6CKPS0" edc:desc="Timer2 Clock Prescale Select bits" edc:mask="0x1" edc:name="T6CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6CKPS1" edc:desc="Timer2 Clock Prescale Select bits" edc:mask="0x1" edc:name="T6CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6ON" edc:desc="Timer2 On bit" edc:mask="0x1" edc:name="TMR6ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS0" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T6OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS1" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T6OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS2" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T6OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS3" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0x1" edc:name="T6OUTPS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6CKPS" edc:desc="Timer2 Clock Prescale Select bits" edc:mask="0x3" edc:name="T2CKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS" edc:desc="Timer2 Output Postscaler Select bits" edc:mask="0xf" edc:name="T2OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7F0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="5"/>
        <edc:SFRDef edc:access="nnc-nnnn" edc:cname="LCDCON" edc:desc="LCD Control Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0011" edc:name="LCDCON" edc:nzwidth="0x8" edc:por="000-0011">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LMUX0" edc:desc="Commons Selection bits" edc:mask="0x1" edc:name="LMUX0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LMUX1" edc:desc="Commons Selection bits" edc:mask="0x1" edc:name="LMUX1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="Clock Source bits" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="Clock Source bits" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WERR" edc:desc="Write Failed Error bit" edc:mask="0x1" edc:name="WERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="LCD Display Sleep-Enabled bit" edc:mask="0x1" edc:name="SLPEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDEN" edc:desc="LCD Module Enable bit" edc:mask="0x1" edc:name="LCDEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LMUX" edc:desc="Commons Selection bits" edc:mask="0x3" edc:name="LMUX" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="Clock Source bits" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrnnnn" edc:cname="LCDPS" edc:desc="LCD Phase Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LCDPS" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LP0" edc:desc="LCD Prescaler Selection bits" edc:mask="0x1" edc:name="LP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LP1" edc:desc="LCD Prescaler Selection bits" edc:mask="0x1" edc:name="LP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LP2" edc:desc="LCD Prescaler Selection bits" edc:mask="0x1" edc:name="LP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LP3" edc:desc="LCD Prescaler Selection bits" edc:mask="0x1" edc:name="LP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WA" edc:desc="Write Allow bit" edc:mask="0x1" edc:name="WA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCDA" edc:desc="LCD Active bit" edc:mask="0x1" edc:name="LCDA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BIASMD" edc:desc="Bias Mode Selection bit" edc:mask="0x1" edc:name="BIASMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WFT" edc:desc="Waveform Type bit" edc:mask="0x1" edc:name="WFT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LP" edc:desc="LCD Prescaler Selection bits" edc:mask="0xf" edc:name="LP" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
